tap "anomalyco/tap"
tap "siddharthvaddem/openscreen"
tap "supabase/tap"
# GitHub command-line tool
brew "gh"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Python version management
brew "pyenv"
# CLI for adding components to your project
brew "shadcn"
# Cross-shell prompt for astronauts
brew "starship"
# Terminal multiplexer
brew "tmux"
# JavaScript package manager
brew "yarn"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# The AI coding agent built for the terminal.
brew "anomalyco/tap/opencode", trusted: true
# Supabase CLI
brew "supabase/tap/supabase", trusted: true
cask "font-go-mono-nerd-font"
# Screen recorder and video editor
cask "siddharthvaddem/openscreen/openscreen", trusted: true
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm@nightly"
vscode "anthropic.claude-code"
vscode "anysphere.cursorpyright"
vscode "catppuccin.catppuccin-vsc"
vscode "dsznajder.es7-react-js-snippets"
vscode "github.vscode-pull-request-github"
vscode "jirkavrba.subway-surfers"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-python-envs"
vscode "msjsdiag.vscode-react-native"
vscode "nikkyamresh.leetcode-practice"
vscode "typescriptteam.native-preview"
vscode "vscodevim.vim"
npm "generator-code"
npm "vsce"
npm "yo"
